{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 271, 1024], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wMAAAAAAAAABQAAAAQAAABDAAAAc0oAAAB0AGoBfACDAX0DfANkARkAfAEaAH0EfAJ8AWQCGABr\nAnIyfAB8AnwEFABkAIUCGQBTAHwAfAJ8BBQAfAJkAhcAfAQUAIUCGQBTACkDTukAAAAA6QEAAAAp\nAtoBS9oFc2hhcGUpBdoBeNoGbl9ncHVz2gRwYXJ02gJzaNoBTKkAcgoAAAD6Ki91c2VyczIva3Vz\ndGVyYS91dy1ubHAvaGVscGVyL211bHRpX2dwdS5wedoLc2xpY2VfYmF0Y2gUAAAAcwoAAAAAAQoB\nDAEMARAB\n", null, null], "function_type": "lambda", "output_shape": ["4wEAAAAAAAAAAQAAAAEAAABTAAAAcwQAAAB8AFMAKQFOqQApAdoFc2hhcGVyAQAAAHIBAAAA+iov\ndXNlcnMyL2t1c3RlcmEvdXctbmxwL2hlbHBlci9tdWx0aV9ncHUucHnaCDxsYW1iZGE+JQAAAPMA\nAAAA\n", null, null], "output_shape_type": "lambda", "arguments": {"n_gpus": 2, "part": 0}}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wMAAAAAAAAABQAAAAQAAABDAAAAc0oAAAB0AGoBfACDAX0DfANkARkAfAEaAH0EfAJ8AWQCGABr\nAnIyfAB8AnwEFABkAIUCGQBTAHwAfAJ8BBQAfAJkAhcAfAQUAIUCGQBTACkDTukAAAAA6QEAAAAp\nAtoBS9oFc2hhcGUpBdoBeNoGbl9ncHVz2gRwYXJ02gJzaNoBTKkAcgoAAAD6Ki91c2VyczIva3Vz\ndGVyYS91dy1ubHAvaGVscGVyL211bHRpX2dwdS5wedoLc2xpY2VfYmF0Y2gUAAAAcwoAAAAAAQoB\nDAEMARAB\n", null, null], "function_type": "lambda", "output_shape": ["4wEAAAAAAAAAAQAAAAEAAABTAAAAcwQAAAB8AFMAKQFOqQApAdoFc2hhcGVyAQAAAHIBAAAA+iov\ndXNlcnMyL2t1c3RlcmEvdXctbmxwL2hlbHBlci9tdWx0aV9ncHUucHnaCDxsYW1iZGE+JQAAAPMA\nAAAA\n", null, null], "output_shape_type": "lambda", "arguments": {"n_gpus": 2, "part": 1}}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "sequential_1", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "batch_input_shape": [null, 271, 1024], "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 512, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 47, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "softmax"}}]}, "inbound_nodes": [[["lambda_1", 0, 0, {}]], [["lambda_2", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": 0}, "inbound_nodes": [[["sequential_1", 1, 0, {}], ["sequential_1", 2, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["concatenate_1", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}